Repository: Sage2vish/LXC-Build-Release-Manager
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: hi, pa

source: %@ — not shown
hi: %@ — नहीं दिखाया गया
pa: %@ — ਨਹੀਂ ਦਿਖਾਇਆ ਗਿਆ

source: %@ defined
hi: %@ निर्धारित
pa: %@ ਨਿਰਧਾਰਿਤ

source: %@ found so far
hi: अब तक %@ मिलीं
pa: ਹੁਣ ਤੱਕ %@ ਮਿਲੀਆਂ

# %@ in %@
source: %1$@ in %2$@
hi: %@ में %@
pa: %@ ਵਿੱਚ %@

source: %@ lines
hi: %@ पंक्तियाँ
pa: %@ ਲਾਈਨਾਂ

source: %@ progress
hi: %@ प्रगति
pa: %@ ਪ੍ਰਗਤੀ

# %@, %@, recent repository
source: %1$@, %2$@, recent repository
hi: %@, %@, हाल की रिपॉज़िटरी
pa: %@, %@, ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀ

source: %lld days
hi: %lld दिन
pa: %lld ਦਿਨ

source: %lld defined
hi: %lld निर्धारित
pa: %lld ਨਿਰਧਾਰਿਤ

source: %lld found so far
hi: अब तक %lld मिलीं
pa: ਹੁਣ ਤੱਕ %lld ਮਿਲੀਆਂ

source: %lld lines
hi: %lld पंक्तियाँ
pa: %lld ਲਾਈਨਾਂ

source: %lld markdown files
hi: %lld markdown फ़ाइलें
pa: %lld markdown ਫ਼ਾਈਲਾਂ

source: %lld markdown files found by repository scan
hi: %lld मार्कडाउन फ़ाइलें रिपॉज़िटरी स्कैन द्वारा मिलीं
pa: %lld ਮਾਰਕਡਾਊਨ ਫ਼ਾਈਲਾਂ ਰਿਪੌਜ਼ਟਰੀ ਸਕੈਨ ਦੁਆਰਾ ਲੱਭੀਆਂ ਗਈਆਂ

# %lld of %lld
source: %1$lld of %2$lld
hi: %lld में से %lld
pa: %lld ਵਿੱਚੋਂ %lld

# %lld parameter%@
source: %1$lld parameter%2$@
hi: %lld पैरामीटर%@
pa: %lld ਪੈਰਾਮੀਟਰ%@

source: ⚠️ Danger Zone
hi: ⚠️ जोखिम क्षेत्र
pa: ⚠️ ਖ਼ਤਰੇ ਦਾ ਖੇਤਰ

source: 0 matches
hi: 0 मिलान
pa: 0 ਮੇਲ

source: 5 seconds
hi: 5 सेकंड
pa: 5 ਸਕਿੰਟ

source: 10 seconds
hi: 10 सेकंड
pa: 10 ਸਕਿੰਟ

source: Actions
hi: क्रियाएँ
pa: ਕਾਰਵਾਈਆਂ

source: Add a local folder or GitHub URL to get started.
hi: शुरू करने के लिए कोई स्थानीय फ़ोल्डर या GitHub URL जोड़ें।
pa: ਸ਼ੁਰੂ ਕਰਨ ਲਈ ਕੋਈ ਸਥਾਨਕ ਫ਼ੋਲਡਰ ਜਾਂ GitHub URL ਜੋੜੋ।

source: Add a local repository folder
hi: स्थानीय रिपॉज़िटरी फ़ोल्डर जोड़ें
pa: ਸਥਾਨਕ ਰਿਪੋਜ਼ਿਟਰੀ ਫ਼ੋਲਡਰ ਜੋੜੋ

source: Add a single shell script, or every script in a folder.
hi: एक शेल स्क्रिप्ट जोड़ें, या फ़ोल्डर की हर स्क्रिप्ट।
pa: ਇੱਕ ਸ਼ੈੱਲ ਸਕ੍ਰਿਪਟ ਜੋੜੋ, ਜਾਂ ਫ਼ੋਲਡਰ ਦੀ ਹਰ ਸਕ੍ਰਿਪਟ।

source: Add All
hi: सभी जोड़ें
pa: ਸਭ ਜੋੜੋ

source: Add Build Script
hi: बिल्ड स्क्रिप्ट जोड़ें
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟ ਜੋੜੋ

source: Add Build Script Folder…
hi: बिल्ड स्क्रिप्ट फ़ोल्डर जोड़ें…
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟ ਫ਼ੋਲਡਰ ਜੋੜੋ…

source: Add Build Script…
hi: बिल्ड स्क्रिप्ट जोड़ें…
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟ ਜੋੜੋ…

source: Add Folder
hi: फ़ोल्डर जोड़ें
pa: ਫ਼ੋਲਡਰ ਜੋੜੋ

source: Add GitHub Repository
hi: GitHub रिपॉज़िटरी जोड़ें
pa: GitHub ਰਿਪੋਜ਼ਿਟਰੀ ਜੋੜੋ

source: Add Repository
hi: रिपॉज़िटरी जोड़ें
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਜੋੜੋ

source: Add Selected
hi: चयनित जोड़ें
pa: ਚੁਣੀਆਂ ਜੋੜੋ

source: Adjust the base text size in the app.
hi: ऐप में मूल पाठ आकार समायोजित करें।
pa: ਐਪ ਵਿੱਚ ਬੁਨਿਆਦੀ ਲਿਖਾਈ ਆਕਾਰ ਅਡਜੱਸਟ ਕਰੋ।

source: Adjust the font size for console text.
hi: कंसोल पाठ का फ़ॉन्ट आकार समायोजित करें।
pa: ਕੰਸੋਲ ਲਿਖਾਈ ਦਾ ਫ਼ੌਂਟ ਆਕਾਰ ਅਡਜੱਸਟ ਕਰੋ।

source: Adjust the spacing and size of elements in the app.
hi: ऐप में तत्वों की दूरी और आकार समायोजित करें।
pa: ਐਪ ਵਿੱਚ ਤੱਤਾਂ ਦੀ ਦੂਰੀ ਅਤੇ ਆਕਾਰ ਅਡਜੱਸਟ ਕਰੋ।

source: Advanced
hi: उन्नत
pa: ਉੱਨਤ

source: Advanced and diagnostic options for power users.
hi: अनुभवी उपयोगकर्ताओं के लिए उन्नत और निदान विकल्प।
pa: ਮਾਹਿਰ ਵਰਤੋਂਕਾਰਾਂ ਲਈ ਉੱਨਤ ਅਤੇ ਡਾਇਗਨੌਸਟਿਕ ਵਿਕਲਪ।

source: All
hi: सभी
pa: ਸਭ

source: All Lines
hi: सभी पंक्तियाँ
pa: ਸਭ ਲਾਈਨਾਂ

source: Allow executing scripts from anywhere in the repository.
hi: रिपॉज़िटरी में कहीं से भी स्क्रिप्ट चलाने दें।
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੱਚ ਕਿਤੇ ਵੀ ਤੋਂ ਸਕ੍ਰਿਪਟਾਂ ਚਲਾਉਣ ਦਿਓ।

source: Allow scripts outside /build/scripts
hi: /build/scripts के बाहर की स्क्रिप्ट की अनुमति दें
pa: /build/scripts ਤੋਂ ਬਾਹਰ ਦੀਆਂ ਸਕ੍ਰਿਪਟਾਂ ਦੀ ਇਜਾਜ਼ਤ ਦਿਓ

source: Already added
hi: पहले से जोड़ी गई
pa: ਪਹਿਲਾਂ ਜੋੜੀ ਗਈ

source: Also detect /build in subfolders when opening a repository.
hi: रिपॉज़िटरी खोलते समय उप-फ़ोल्डरों में भी /build खोजें।
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਖੋਲ੍ਹਣ ਵੇਲੇ ਉਪ-ਫ਼ੋਲਡਰਾਂ ਵਿੱਚ ਵੀ /build ਲੱਭੋ।

source: Appearance
hi: रूप
pa: ਦਿੱਖ

source: Appearance: follow the system, or force bright or dark
hi: दिखावट: सिस्टम का पालन करें, या उज्ज्वल या गहरा लागू करें
pa: ਦਿੱਖ: ਸਿਸਟਮ ਦੀ ਪਾਲਣਾ ਕਰੋ, ਜਾਂ ਚਮਕਦਾਰ ਜਾਂ ਗੂੜ੍ਹਾ ਲਾਗੂ ਕਰੋ

source: Applied when opening a log.
hi: लॉग खोलते समय लागू होता है।
pa: ਲੌਗ ਖੋਲ੍ਹਣ ਵੇਲੇ ਲਾਗੂ ਹੁੰਦਾ ਹੈ।

source: Ask for confirmation before clearing history or deleting logs.
hi: इतिहास साफ़ करने या लॉग हटाने से पहले पुष्टि माँगें।
pa: ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰਨ ਜਾਂ ਲੌਗ ਮਿਟਾਉਣ ਤੋਂ ਪਹਿਲਾਂ ਪੁਸ਼ਟੀ ਮੰਗੋ।

source: Auto Find
hi: स्वतः खोजें
pa: ਆਟੋ ਲੱਭੋ

source: Auto Find build scripts
hi: बिल्ड स्क्रिप्ट स्वतः खोजें
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਆਟੋ ਲੱਭੋ

source: Auto Find Build Scripts
hi: बिल्ड स्क्रिप्ट स्वतः खोजें
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਆਟੋ ਲੱਭੋ

source: Auto-detect
hi: स्वतः पहचान
pa: ਆਟੋ-ਪਛਾਣ

source: Auto-detect repositories on startup
hi: शुरू होने पर रिपॉज़िटरी स्वतः पहचानें
pa: ਸ਼ੁਰੂ ਹੋਣ ਤੇ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਆਟੋ-ਪਛਾਣੋ

# Auto-detected from /%@/%@
source: Auto-detected from /%1$@/%2$@
hi: /%@/%@ से स्वतः पहचाना गया
pa: /%@/%@ ਤੋਂ ਆਟੋ-ਪਛਾਣਿਆ ਗਿਆ

source: Auto-scroll
hi: स्वतः स्क्रॉल
pa: ਆਟੋ-ਸਕ੍ਰੌਲ

source: Auto-scroll to bottom
hi: स्वतः नीचे स्क्रॉल करें
pa: ਆਟੋ ਹੇਠਾਂ ਸਕ੍ਰੌਲ ਕਰੋ

source: Automatically delete logs older than the selected period.
hi: चुनी गई अवधि से पुराने लॉग स्वतः हटाएँ।
pa: ਚੁਣੀ ਗਈ ਮਿਆਦ ਤੋਂ ਪੁਰਾਣੇ ਲੌਗ ਆਟੋਮੈਟਿਕ ਮਿਟਾਓ।

source: Automatically restore last opened repositories
hi: पिछली बार खुली रिपॉज़िटरी स्वतः पुनर्स्थापित करें
pa: ਪਿਛਲੀ ਵਾਰ ਖੁੱਲੀਆਂ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਆਟੋਮੈਟਿਕ ਬਹਾਲ ਕਰੋ

source: Automatically save logs
hi: लॉग स्वतः सहेजें
pa: ਲੌਗ ਆਟੋਮੈਟਿਕ ਸੇਵ ਕਰੋ

source: Automatically scroll to the latest output.
hi: नवीनतम आउटपुट पर स्वतः स्क्रॉल करें।
pa: ਨਵੀਨਤਮ ਆਉਟਪੁੱਟ ਤੇ ਆਟੋਮੈਟਿਕ ਸਕ੍ਰੌਲ ਕਰੋ।

source: Automatically start the application when you log in to macOS.
hi: macOS में लॉग इन करते ही ऐप्लिकेशन स्वतः शुरू करें।
pa: macOS ਵਿੱਚ ਲੌਗਿਨ ਕਰਨ ਤੇ ਐਪਲੀਕੇਸ਼ਨ ਆਟੋਮੈਟਿਕ ਸ਼ੁਰੂ ਕਰੋ।

source: Available build scripts
hi: उपलब्ध बिल्ड स्क्रिप्ट
pa: ਉਪਲਬਧ ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ

source: Available Build Scripts
hi: उपलब्ध बिल्ड स्क्रिप्ट
pa: ਉਪਲਬਧ ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ

source: Avg Duration
hi: औसत अवधि
pa: ਔਸਤ ਮਿਆਦ

source: Avoid interrupting you while you're already in the app.
hi: जब आप ऐप में ही हों तो बाधा न डालें।
pa: ਜਦੋਂ ਤੁਸੀਂ ਐਪ ਵਿੱਚ ਹੀ ਹੋ ਤਾਂ ਵਿਘਨ ਨਾ ਪਾਓ।

source: Beta
hi: बीटा
pa: ਬੀਟਾ

source: Branch
hi: ब्रांच
pa: ਸ਼ਾਖਾ

source: Build
hi: बिल्ड
pa: ਬਿਲਡ

source: Build Cancelled / Stopped
hi: बिल्ड रद्द / रोका गया
pa: ਬਿਲਡ ਰੱਦ / ਰੋਕਿਆ ਗਿਆ

source: Build error: %@
hi: बिल्ड त्रुटि: %@
pa: ਬਿਲਡ ਗਲਤੀ: %@

source: Build Execution
hi: बिल्ड निष्पादन
pa: ਬਿਲਡ ਅਮਲ

source: Build Failed
hi: बिल्ड विफल
pa: ਬਿਲਡ ਅਸਫਲ

source: Build folder warning: %@
hi: बिल्ड फ़ोल्डर चेतावनी: %@
pa: ਬਿਲਡ ਫ਼ੋਲਡਰ ਚੇਤਾਵਨੀ: %@

source: Build History
hi: बिल्ड इतिहास
pa: ਬਿਲਡ ਇਤਿਹਾਸ

source: Build Manager
hi: बिल्ड मैनेजर
pa: ਬਿਲਡ ਮੈਨੇਜਰ

source: Build output log area
hi: बिल्ड आउटपुट लॉग क्षेत्र
pa: ਬਿਲਡ ਆਉਟਪੁੱਟ ਲੌਗ ਖੇਤਰ

source: Build Parameters
hi: बिल्ड पैरामीटर
pa: ਬਿਲਡ ਪੈਰਾਮੀਟਰ

source: Build Running
hi: बिल्ड चल रहा है
pa: ਬਿਲਡ ਚੱਲ ਰਿਹਾ ਹੈ

source: Build Started
hi: बिल्ड शुरू हुआ
pa: ਬਿਲਡ ਸ਼ੁਰੂ ਹੋਇਆ

source: Build Status
hi: बिल्ड स्थिति
pa: ਬਿਲਡ ਸਥਿਤੀ

source: Build Succeeded
hi: बिल्ड सफल
pa: ਬਿਲਡ ਸਫਲ

source: Build system
hi: बिल्ड सिस्टम
pa: ਬਿਲਡ ਸਿਸਟਮ

source: Build timeout (min, 0 = no limit)
hi: बिल्ड समय-सीमा (मिनट, 0 = कोई सीमा नहीं)
pa: ਬਿਲਡ ਟਾਈਮਆਉਟ (ਮਿੰਟ, 0 = ਕੋਈ ਸੀਮਾ ਨਹੀਂ)

source: Cancel
hi: रद्द करें
pa: ਰੱਦ ਕਰੋ

source: Cancel editing
hi: संपादन रद्द करें
pa: ਸੰਪਾਦਨ ਰੱਦ ਕਰੋ

source: Case sensitive search in logs.
hi: लॉग में केस-संवेदी खोज।
pa: ਲੌਗ ਵਿੱਚ ਕੇਸ-ਸੰਵੇਦਨਸ਼ੀਲ ਖੋਜ।

source: Character encoding for log files.
hi: लॉग फ़ाइलों की वर्ण एन्कोडिंग।
pa: ਲੌਗ ਫ਼ਾਈਲਾਂ ਦੀ ਅੱਖਰ ਏਨਕੋਡਿੰਗ।

source: Check default locations for repositories when app launches.
hi: ऐप शुरू होने पर डिफ़ॉल्ट स्थानों में रिपॉज़िटरी देखें।
pa: ਐਪ ਸ਼ੁਰੂ ਹੋਣ ਤੇ ਡਿਫ਼ਾਲਟ ਥਾਵਾਂ ਵਿੱਚ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਦੇਖੋ।

source: Check for updates automatically
hi: अपडेट स्वतः जाँचें
pa: ਅਪਡੇਟ ਆਟੋਮੈਟਿਕ ਜਾਂਚੋ

source: Check GitHub Releases for a newer version when Build Manager starts.
hi: बिल्ड मैनेजर शुरू होने पर GitHub Releases में नया संस्करण देखें।
pa: ਬਿਲਡ ਮੈਨੇਜਰ ਸ਼ੁਰੂ ਹੋਣ ਤੇ GitHub Releases ਵਿੱਚ ਨਵਾਂ ਸੰਸਕਰਣ ਦੇਖੋ।

source: Check Now
hi: अभी जाँचें
pa: ਹੁਣੇ ਜਾਂਚੋ

source: Checking the repository for runnable build scripts.
hi: रिपॉज़िटरी में चलाने योग्य बिल्ड स्क्रिप्ट खोजी जा रही हैं।
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੱਚ ਚਲਾਉਣਯੋਗ ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਲੱਭੀਆਂ ਜਾ ਰਹੀਆਂ ਹਨ।

source: Checking…
hi: जाँच हो रही है…
pa: ਜਾਂਚ ਹੋ ਰਹੀ ਹੈ…

source: Choose a local folder to add as a repository
hi: रिपॉज़िटरी के रूप में जोड़ने के लिए स्थानीय फ़ोल्डर चुनें
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਵਜੋਂ ਜੋੜਨ ਲਈ ਸਥਾਨਕ ਫ਼ੋਲਡਰ ਚੁਣੋ

source: Choose a markdown file on the left to read it here.
hi: यहाँ पढ़ने के लिए बाईं ओर से कोई markdown फ़ाइल चुनें।
pa: ਇੱਥੇ ਪੜ੍ਹਨ ਲਈ ਖੱਬੇ ਪਾਸੇ ਤੋਂ ਕੋਈ markdown ਫ਼ਾਈਲ ਚੁਣੋ।

source: Choose a repository from the sidebar, or add one to begin.
hi: साइडबार से कोई रिपॉज़िटरी चुनें, या शुरू करने के लिए एक जोड़ें।
pa: ਸਾਈਡਬਾਰ ਤੋਂ ਕੋਈ ਰਿਪੋਜ਼ਿਟਰੀ ਚੁਣੋ, ਜਾਂ ਸ਼ੁਰੂ ਕਰਨ ਲਈ ਇੱਕ ਜੋੜੋ।

source: Choose Local Folder…
hi: स्थानीय फ़ोल्डर चुनें…
pa: ਸਥਾਨਕ ਫ਼ੋਲਡਰ ਚੁਣੋ…

source: Choose the width of the left sidebar.
hi: बाएँ साइडबार की चौड़ाई चुनें।
pa: ਖੱਬੇ ਸਾਈਡਬਾਰ ਦੀ ਚੌੜਾਈ ਚੁਣੋ।

source: Choose…
hi: चुनें…
pa: ਚੁਣੋ…

source: Clear
hi: साफ़ करें
pa: ਸਾਫ਼ ਕਰੋ

source: Clear build history
hi: बिल्ड इतिहास साफ़ करें
pa: ਬਿਲਡ ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰੋ

source: Clear Build History?
hi: बिल्ड इतिहास साफ़ करें?
pa: ਬਿਲਡ ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰੋ?

source: Clear Cache
hi: कैश साफ़ करें
pa: ਕੈਸ਼ ਸਾਫ਼ ਕਰੋ

source: Clear History
hi: इतिहास साफ़ करें
pa: ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰੋ

source: Clear output
hi: आउटपुट साफ़ करें
pa: ਆਉਟਪੁੱਟ ਸਾਫ਼ ਕਰੋ

source: Clear repository metadata cache
hi: रिपॉज़िटरी मेटाडेटा कैश साफ़ करें
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਮੈਟਾਡੇਟਾ ਕੈਸ਼ ਸਾਫ਼ ਕਰੋ

source: Clear this repository's build history?
hi: इस रिपॉज़िटरी का बिल्ड इतिहास साफ़ करें?
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਦਾ ਬਿਲਡ ਇਤਿਹਾਸ ਸਾਫ਼ ਕਰੋ?

source: Clears visible output without deleting saved build history.
hi: सहेजा गया बिल्ड इतिहास हटाए बिना दिखता आउटपुट साफ़ करता है।
pa: ਸੇਵ ਕੀਤਾ ਬਿਲਡ ਇਤਿਹਾਸ ਮਿਟਾਏ ਬਿਨਾਂ ਦਿੱਖਣ ਵਾਲਾ ਆਉਟਪੁੱਟ ਸਾਫ਼ ਕਰਦਾ ਹੈ।

source: Close
hi: बंद करें
pa: ਬੰਦ ਕਰੋ

source: Colorize output
hi: आउटपुट रंगीन करें
pa: ਆਉਟਪੁੱਟ ਰੰਗੀਨ ਕਰੋ

source: Combine multiple events into a single notification.
hi: कई घटनाओं को एक ही सूचना में मिलाएँ।
pa: ਕਈ ਘਟਨਾਵਾਂ ਨੂੰ ਇੱਕੋ ਸੂਚਨਾ ਵਿੱਚ ਮਿਲਾਓ।

source: Comfortable
hi: आरामदायक
pa: ਆਰਾਮਦਾਇਕ

source: Compact
hi: सघन
pa: ਸੰਘਣਾ

source: Completed
hi: पूर्ण
pa: ਮੁਕੰਮਲ

source: Configure how and when you want to be notified about builds.
hi: तय करें कि बिल्ड की सूचना कैसे और कब मिले।
pa: ਤੈਅ ਕਰੋ ਕਿ ਬਿਲਡ ਦੀ ਸੂਚਨਾ ਕਿਵੇਂ ਅਤੇ ਕਦੋਂ ਮਿਲੇ।

source: Configure how build scripts are executed.
hi: तय करें कि बिल्ड स्क्रिप्ट कैसे चलें।
pa: ਤੈਅ ਕਰੋ ਕਿ ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਕਿਵੇਂ ਚੱਲਣ।

source: Configure how logs are stored and displayed.
hi: तय करें कि लॉग कैसे संग्रहित और प्रदर्शित हों।
pa: ਤੈਅ ਕਰੋ ਕਿ ਲੌਗ ਕਿਵੇਂ ਸੰਭਾਲੇ ਅਤੇ ਦਿਖਾਏ ਜਾਣ।

source: Configure how repositories are discovered, scanned, and remembered.
hi: तय करें कि रिपॉज़िटरी कैसे खोजी, स्कैन और याद रखी जाएँ।
pa: ਤੈਅ ਕਰੋ ਕਿ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਕਿਵੇਂ ਲੱਭੀਆਂ, ਸਕੈਨ ਅਤੇ ਯਾਦ ਰੱਖੀਆਂ ਜਾਣ।

source: Confirm before clearing history or logs
hi: इतिहास या लॉग साफ़ करने से पहले पुष्टि करें
pa: ਇਤਿਹਾਸ ਜਾਂ ਲੌਗ ਸਾਫ਼ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਪੁਸ਼ਟੀ ਕਰੋ

source: Confirm before quitting while a build is running
hi: बिल्ड चलते समय बंद करने से पहले पुष्टि करें
pa: ਬਿਲਡ ਚੱਲਦੇ ਸਮੇਂ ਬੰਦ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਪੁਸ਼ਟੀ ਕਰੋ

source: Connected
hi: कनेक्टेड
pa: ਕਨੈਕਟਡ

source: Connection
hi: कनेक्शन
pa: ਕਨੈਕਸ਼ਨ

source: Console font
hi: कंसोल फ़ॉन्ट
pa: ਕੰਸੋਲ ਫ਼ੌਂਟ

source: Copied
hi: कॉपी हो गया
pa: ਕਾਪੀ ਹੋ ਗਿਆ

source: Copy
hi: कॉपी करें
pa: ਕਾਪੀ ਕਰੋ

source: Copy code block
hi: कोड ब्लॉक कॉपी करें
pa: ਕੋਡ ਬਲਾਕ ਕਾਪੀ ਕਰੋ

source: Copy document path
hi: दस्तावेज़ पथ कॉपी करें
pa: ਦਸਤਾਵੇਜ਼ ਰਸਤਾ ਕਾਪੀ ਕਰੋ

source: Copy Path
hi: पथ कॉपी करें
pa: ਰਸਤਾ ਕਾਪੀ ਕਰੋ

source: Copy repository path
hi: रिपॉज़िटरी पथ कॉपी करें
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਰਸਤਾ ਕਾਪੀ ਕਰੋ

source: Copy Script Path
hi: स्क्रिप्ट पथ कॉपी करें
pa: ਸਕ੍ਰਿਪਟ ਰਸਤਾ ਕਾਪੀ ਕਰੋ

source: Could Not Open Document
hi: दस्तावेज़ नहीं खुल सका
pa: ਦਸਤਾਵੇਜ਼ ਨਹੀਂ ਖੁੱਲ੍ਹਿਆ

source: Custom
hi: कस्टम
pa: ਕਸਟਮ

source: Custom build timeout (overrides per-build timeout, 0 = none)
hi: कस्टम बिल्ड समय-सीमा (प्रति-बिल्ड सीमा पर हावी, 0 = कोई नहीं)
pa: ਕਸਟਮ ਬਿਲਡ ਟਾਈਮਆਉਟ (ਪ੍ਰਤੀ-ਬਿਲਡ ਸੀਮਾ ਤੋਂ ਵੱਧ, 0 = ਕੋਈ ਨਹੀਂ)

source: Customize the look and feel of Build Manager.
hi: बिल्ड मैनेजर का रूप-रंग अनुकूलित करें।
pa: ਬਿਲਡ ਮੈਨੇਜਰ ਦਾ ਰੂਪ ਅਤੇ ਅਹਿਸਾਸ ਅਨੁਕੂਲ ਕਰੋ।

source: Data & Maintenance
hi: डेटा और रखरखाव
pa: ਡੇਟਾ ਅਤੇ ਰੱਖ-ਰਖਾਅ

source: Default /build folder name
hi: डिफ़ॉल्ट /build फ़ोल्डर नाम
pa: ਡਿਫ਼ਾਲਟ /build ਫ਼ੋਲਡਰ ਨਾਮ

source: Default behavior after build completes
hi: बिल्ड पूरा होने के बाद डिफ़ॉल्ट व्यवहार
pa: ਬਿਲਡ ਮੁਕੰਮਲ ਹੋਣ ਤੋਂ ਬਾਅਦ ਡਿਫ਼ਾਲਟ ਵਿਹਾਰ

source: Default log filter
hi: डिफ़ॉल्ट लॉग फ़िल्टर
pa: ਡਿਫ਼ਾਲਟ ਲੌਗ ਫ਼ਿਲਟਰ

source: Default repository root detection
hi: डिफ़ॉल्ट रिपॉज़िटरी रूट पहचान
pa: ਡਿਫ਼ਾਲਟ ਰਿਪੋਜ਼ਿਟਰੀ ਰੂਟ ਪਛਾਣ

source: Default shell
hi: डिफ़ॉल्ट शेल
pa: ਡਿਫ਼ਾਲਟ ਸ਼ੈੱਲ

source: Default tab on launch
hi: शुरू होने पर डिफ़ॉल्ट टैब
pa: ਸ਼ੁਰੂ ਹੋਣ ਤੇ ਡਿਫ਼ਾਲਟ ਟੈਬ

source: Detect executable files automatically
hi: निष्पादन योग्य फ़ाइलें स्वतः पहचानें
pa: ਚਲਾਉਣਯੋਗ ਫ਼ਾਈਲਾਂ ਆਟੋਮੈਟਿਕ ਪਛਾਣੋ

source: Diagnostics log location
hi: निदान लॉग का स्थान
pa: ਡਾਇਗਨੌਸਟਿਕ ਲੌਗ ਦੀ ਥਾਂ

source: Directory where scripts are executed.
hi: वह डायरेक्टरी जहाँ स्क्रिप्ट चलती हैं।
pa: ਉਹ ਡਾਇਰੈਕਟਰੀ ਜਿੱਥੇ ਸਕ੍ਰਿਪਟਾਂ ਚੱਲਦੀਆਂ ਹਨ।

source: Docs
hi: दस्तावेज़
pa: ਦਸਤਾਵੇਜ਼

source: Document %@
hi: दस्तावेज़ %@
pa: ਦਸਤਾਵੇਜ਼ %@

source: Document view mode
hi: दस्तावेज़ दृश्य मोड
pa: ਦਸਤਾਵੇਜ਼ ਦ੍ਰਿਸ਼ ਮੋਡ

source: Documents
hi: दस्तावेज़
pa: ਦਸਤਾਵੇਜ਼

source: Done
hi: पूर्ण
pa: ਹੋ ਗਿਆ

source: Download the update
hi: अपडेट डाउनलोड करें
pa: ਅਪਡੇਟ ਡਾਊਨਲੋਡ ਕਰੋ

source: Duration
hi: अवधि
pa: ਮਿਆਦ

source: Edit
hi: संपादित करें
pa: ਸੰਪਾਦਿਤ ਕਰੋ

source: Edit document source
hi: दस्तावेज़ स्रोत संपादित करें
pa: ਦਸਤਾਵੇਜ਼ ਸਰੋਤ ਸੰਪਾਦਿਤ ਕਰੋ

source: Enable build notifications
hi: बिल्ड सूचनाएँ सक्षम करें
pa: ਬਿਲਡ ਸੂਚਨਾਵਾਂ ਸਮਰੱਥ ਕਰੋ

source: Enable detailed internal logging for troubleshooting.
hi: समस्या निवारण के लिए विस्तृत आंतरिक लॉगिंग सक्षम करें।
pa: ਸਮੱਸਿਆ ਹੱਲ ਕਰਨ ਲਈ ਵਿਸਤਾਰਿਤ ਅੰਦਰੂਨੀ ਲੌਗਿੰਗ ਸਮਰੱਥ ਕਰੋ।

source: Enable subtle animations for a smoother experience.
hi: सहज अनुभव के लिए हल्के एनिमेशन सक्षम करें।
pa: ਸੁਚਾਰੂ ਅਨੁਭਵ ਲਈ ਹਲਕੇ ਐਨੀਮੇਸ਼ਨ ਸਮਰੱਥ ਕਰੋ।

source: Encoding
hi: एन्कोडिंग
pa: ਏਨਕੋਡਿੰਗ

source: English is the main language. Changing this needs a relaunch.
hi: अंग्रेज़ी मुख्य भाषा है। इसे बदलने पर ऐप फिर से शुरू करना होगा।
pa: ਅੰਗਰੇਜ਼ੀ ਮੁੱਖ ਭਾਸ਼ਾ ਹੈ। ਇਸ ਨੂੰ ਬਦਲਣ ਲਈ ਐਪ ਦੁਬਾਰਾ ਸ਼ੁਰੂ ਕਰਨੀ ਪਵੇਗੀ।

source: Enter a full GitHub repo URL, like https://github.com/user/repo
hi: पूरा GitHub रिपॉज़िटरी URL डालें, जैसे https://github.com/user/repo
pa: ਪੂਰਾ GitHub ਰਿਪੋ URL ਦਰਜ ਕਰੋ, ਜਿਵੇਂ https://github.com/user/repo

source: Enter text to filter log lines
hi: लॉग पंक्तियाँ छानने के लिए पाठ डालें
pa: ਲੌਗ ਲਾਈਨਾਂ ਫ਼ਿਲਟਰ ਕਰਨ ਲਈ ਲਿਖਾਈ ਦਰਜ ਕਰੋ

source: Environment variables
hi: एनवायरनमेंट वेरिएबल
pa: ਵਾਤਾਵਰਣ ਵੇਰੀਏਬਲ

source: Errors
hi: त्रुटियाँ
pa: ਗਲਤੀਆਂ

source: Every build run will be saved to a log file.
hi: हर बिल्ड रन एक लॉग फ़ाइल में सहेजा जाएगा।
pa: ਹਰ ਬਿਲਡ ਰਨ ਇੱਕ ਲੌਗ ਫ਼ਾਈਲ ਵਿੱਚ ਸੇਵ ਕੀਤਾ ਜਾਵੇਗਾ।

source: Export Current Log
hi: वर्तमान लॉग निर्यात करें
pa: ਮੌਜੂਦਾ ਲੌਗ ਨਿਰਯਾਤ ਕਰੋ

source: Export the full output to a file.
hi: पूरा आउटपुट किसी फ़ाइल में निर्यात करें।
pa: ਪੂਰਾ ਆਉਟਪੁੱਟ ਕਿਸੇ ਫ਼ਾਈਲ ਵਿੱਚ ਨਿਰਯਾਤ ਕਰੋ।

source: Filter by outcome
hi: परिणाम से छाँटें
pa: ਨਤੀਜੇ ਦੁਆਰਾ ਫ਼ਿਲਟਰ ਕਰੋ

source: Filter by script
hi: स्क्रिप्ट से छाँटें
pa: ਸਕ੍ਰਿਪਟ ਦੁਆਰਾ ਫ਼ਿਲਟਰ ਕਰੋ

source: Filter documents
hi: दस्तावेज़ छाँटें
pa: ਦਸਤਾਵੇਜ਼ ਫ਼ਿਲਟਰ ਕਰੋ

source: Filter files
hi: फ़ाइलें छाँटें
pa: ਫ਼ਾਈਲਾਂ ਫ਼ਿਲਟਰ ਕਰੋ

source: Folder %@
hi: फ़ोल्डर %@
pa: ਫ਼ੋਲਡਰ %@

source: Folder name that contains scripts, logs, and project config.
hi: वह फ़ोल्डर नाम जिसमें स्क्रिप्ट, लॉग और प्रोजेक्ट कॉन्फ़िग हैं।
pa: ਉਹ ਫ਼ੋਲਡਰ ਨਾਮ ਜਿਸ ਵਿੱਚ ਸਕ੍ਰਿਪਟਾਂ, ਲੌਗ ਅਤੇ ਪ੍ਰੋਜੈਕਟ ਕੌਨਫ਼ਿਗ ਹਨ।

source: Font size
hi: फ़ॉन्ट आकार
pa: ਫ਼ੌਂਟ ਆਕਾਰ

source: Font used in the live output and log viewer.
hi: लाइव आउटपुट और लॉग व्यूअर में उपयोग होने वाला फ़ॉन्ट।
pa: ਲਾਈਵ ਆਉਟਪੁੱਟ ਅਤੇ ਲੌਗ ਵਿਊਅਰ ਵਿੱਚ ਵਰਤਿਆ ਫ਼ੌਂਟ।

source: Format used for timestamps in logs and console.
hi: लॉग और कंसोल में समय-मुहर का प्रारूप।
pa: ਲੌਗ ਅਤੇ ਕੰਸੋਲ ਵਿੱਚ ਸਮੇਂ-ਮੋਹਰ ਲਈ ਵਰਤਿਆ ਫ਼ਾਰਮੈਟ।

source: Full path
hi: पूरा पथ
pa: ਪੂਰਾ ਰਸਤਾ

source: Full script path: %@
hi: पूरा स्क्रिप्ट पथ: %@
pa: ਪੂਰਾ ਸਕ੍ਰਿਪਟ ਰਸਤਾ: %@

source: General
hi: सामान्य
pa: ਸਾਧਾਰਨ

source: GitHub access (optional)
hi: GitHub पहुँच (वैकल्पिक)
pa: GitHub ਪਹੁੰਚ (ਵਿਕਲਪਿਕ)

source: GitHub Origin
hi: GitHub स्रोत
pa: GitHub ਮੂਲ

source: GitHub rate limit alerts
hi: GitHub दर-सीमा चेतावनियाँ
pa: GitHub ਰੇਟ ਸੀਮਾ ਸੁਚੇਤਨਾਵਾਂ

source: GitHub repositories can be scanned, but must be cloned locally before they can be run.
hi: GitHub रिपॉज़िटरी स्कैन की जा सकती हैं, पर चलाने से पहले उन्हें स्थानीय रूप से क्लोन करना होगा।
pa: GitHub ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਸਕੈਨ ਕੀਤੀਆਂ ਜਾ ਸਕਦੀਆਂ ਹਨ, ਪਰ ਚਲਾਉਣ ਤੋਂ ਪਹਿਲਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਸਥਾਨਕ ਤੌਰ ਤੇ ਕਲੋਨ ਕਰਨਾ ਪਵੇਗਾ।

source: GitHub URL
hi: GitHub का URL
pa: GitHub ਦਾ URL

source: Group multiple notifications
hi: कई सूचनाएँ समूहित करें
pa: ਕਈ ਸੂਚਨਾਵਾਂ ਸਮੂਹਿਤ ਕਰੋ

source: Hide Detail View
hi: विवरण दृश्य छिपाएँ
pa: ਵੇਰਵਾ ਦ੍ਰਿਸ਼ ਛੁਪਾਓ

source: Hide repository paths
hi: रिपॉज़िटरी पथ छिपाएँ
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਰਸਤੇ ਲੁਕਾਓ

source: Hide Sidebar
hi: साइडबार छिपाएँ
pa: ਸਾਈਡਬਾਰ ਲੁਕਾਓ

source: Hide the repository sidebar
hi: रिपॉज़िटरी साइडबार छिपाएँ
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਸਾਈਡਬਾਰ ਲੁਕਾਓ

source: Hide the right panel
hi: दायाँ पैनल छिपाएँ
pa: ਸੱਜਾ ਪੈਨਲ ਛੁਪਾਓ

source: Highlight INFO / WARN / ERROR / SUCCESS.
hi: INFO / WARN / ERROR / SUCCESS को उभारें।
pa: INFO / WARN / ERROR / SUCCESS ਨੂੰ ਉਭਾਰੋ।

source: History
hi: इतिहास
pa: ਇਤਿਹਾਸ

source: How long notifications stay visible.
hi: सूचनाएँ कितनी देर दिखें।
pa: ਸੂਚਨਾਵਾਂ ਕਿੰਨੀ ਦੇਰ ਦਿੱਖਦੀਆਂ ਰਹਿਣ।

source: Image not shown: %@
hi: छवि नहीं दिखाई गई: %@
pa: ਤਸਵੀਰ ਨਹੀਂ ਦਿਖਾਈ ਗਈ: %@

source: In Progress
hi: चल रहा है
pa: ਚੱਲ ਰਿਹਾ ਹੈ

source: In repo
hi: रिपॉज़िटरी में
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੱਚ

source: In repository
hi: रिपॉज़िटरी में
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੱਚ

source: Info
hi: जानकारी
pa: ਜਾਣਕਾਰੀ

source: Keep output generated before a build is cancelled.
hi: बिल्ड रद्द होने से पहले का आउटपुट रखें।
pa: ਬਿਲਡ ਰੱਦ ਹੋਣ ਤੋਂ ਪਹਿਲਾਂ ਦਾ ਆਉਟਪੁੱਟ ਰੱਖੋ।

source: Keep system awake during long running builds.
hi: लंबे बिल्ड के दौरान सिस्टम जगा रखें।
pa: ਲੰਬੀਆਂ ਬਿਲਡਾਂ ਦੌਰਾਨ ਸਿਸਟਮ ਜਾਗਦਾ ਰੱਖੋ।

source: Kill all child processes and their children when build is stopped.
hi: बिल्ड रुकने पर सभी चाइल्ड प्रोसेस और उनकी संतति समाप्त करें।
pa: ਬਿਲਡ ਰੁਕਣ ਤੇ ਸਾਰੀਆਂ ਚਾਈਲਡ ਪ੍ਰੋਸੈੱਸਾਂ ਅਤੇ ਉਨ੍ਹਾਂ ਦੀਆਂ ਸੰਤਾਨਾਂ ਖਤਮ ਕਰੋ।

source: Kill all child processes when a build is stopped.
hi: बिल्ड रुकने पर सभी चाइल्ड प्रोसेस समाप्त करें।
pa: ਬਿਲਡ ਰੁਕਣ ਤੇ ਸਾਰੀਆਂ ਚਾਈਲਡ ਪ੍ਰੋਸੈੱਸਾਂ ਖਤਮ ਕਰੋ।

source: Language
hi: भाषा
pa: ਭਾਸ਼ਾ

source: Language used by the app's own interface
hi: ऐप के अपने इंटरफ़ेस की भाषा
pa: ਐਪ ਦੇ ਆਪਣੇ ਇੰਟਰਫ਼ੇਸ ਦੀ ਭਾਸ਼ਾ

source: Last accessed %@
hi: अंतिम बार खोला गया %@
pa: ਆਖਰੀ ਵਾਰ ਖੋਲ੍ਹਿਆ %@

# Last failed build: %@ — %@
source: Last failed build: %1$@ — %2$@
hi: अंतिम विफल बिल्ड: %@ — %@
pa: ਆਖਰੀ ਅਸਫਲ ਬਿਲਡ: %@ — %@

source: Last run
hi: अंतिम रन
pa: ਆਖਰੀ ਰਨ

source: Launch Build Manager at login
hi: लॉगिन पर बिल्ड मैनेजर शुरू करें
pa: ਲੌਗਿਨ ਤੇ ਬਿਲਡ ਮੈਨੇਜਰ ਸ਼ੁਰੂ ਕਰੋ

source: Light, dark, or match the system appearance.
hi: हल्का, गहरा, या सिस्टम रूप के अनुसार।
pa: ਹਲਕਾ, ਗੂੜ੍ਹਾ, ਜਾਂ ਸਿਸਟਮ ਦਿੱਖ ਦੇ ਅਨੁਸਾਰ।

source: Limit how many repositories are kept in the Recent list.
hi: हाल की सूची में कितनी रिपॉज़िटरी रखी जाएँ, यह सीमित करें।
pa: ਤਾਜ਼ਾ ਸੂਚੀ ਵਿੱਚ ਕਿੰਨੀਆਂ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਰੱਖੀਆਂ ਜਾਣ, ਇਹ ਸੀਮਤ ਕਰੋ।

source: Line number %lld
hi: पंक्ति संख्या %lld
pa: ਲਾਈਨ ਨੰਬਰ %lld

source: Line spacing
hi: पंक्ति अंतराल
pa: ਲਾਈਨ ਵਿੱਚ ਦੂਰੀ

source: Live Output
hi: लाइव आउटपुट
pa: ਲਾਈਵ ਆਉਟਪੁੱਟ

source: Local folder
hi: स्थानीय फ़ोल्डर
pa: ਸਥਾਨਕ ਫ਼ੋਲਡਰ

source: Location where diagnostic logs are stored.
hi: वह स्थान जहाँ निदान लॉग संग्रहित होते हैं।
pa: ਉਹ ਥਾਂ ਜਿੱਥੇ ਡਾਇਗਨੌਸਟਿਕ ਲੌਗ ਸੰਭਾਲੇ ਜਾਂਦੇ ਹਨ।

source: Log internal diagnostics to file
hi: आंतरिक निदान फ़ाइल में दर्ज करें
pa: ਅੰਦਰੂਨੀ ਡਾਇਗਨੌਸਟਿਕ ਫ਼ਾਈਲ ਵਿੱਚ ਦਰਜ ਕਰੋ

source: Log retention period
hi: लॉग रखने की अवधि
pa: ਲੌਗ ਰੱਖਣ ਦੀ ਮਿਆਦ

source: Logs
hi: लॉग
pa: ਲੌਗ

source: Logs & Console
hi: लॉग और कंसोल
pa: ਲੌਗ ਅਤੇ ਕੰਸੋਲ

source: Logs directory (inside /build)
hi: लॉग डायरेक्टरी (/build के अंदर)
pa: ਲੌਗ ਡਾਇਰੈਕਟਰੀ (/build ਦੇ ਅੰਦਰ)

source: Long Running Build Completed
hi: लंबा बिल्ड पूरा हुआ
pa: ਲੰਬੀ ਬਿਲਡ ਮੁਕੰਮਲ ਹੋਈ

source: Markdown source
hi: Markdown स्रोत
pa: Markdown ਸਰੋਤ

source: Markdown source editor
hi: Markdown स्रोत संपादक
pa: Markdown ਸਰੋਤ ਸੰਪਾਦਕ

source: Max concurrent builds
hi: अधिकतम समवर्ती बिल्ड
pa: ਵੱਧ ਤੋਂ ਵੱਧ ਇੱਕੋ ਵੇਲੇ ਬਿਲਡਾਂ

source: Maximize log pane
hi: लॉग पैनल बड़ा करें
pa: ਲੌਗ ਪੈਨਲ ਵੱਡਾ ਕਰੋ

source: Maximize Log Pane
hi: लॉग पैनल बड़ा करें
pa: ਲੌਗ ਪੈਨਲ ਵੱਡਾ ਕਰੋ

source: Maximum concurrent builds reached. Stop one build before starting another.
hi: एक साथ चलने वाले बिल्ड की सीमा पूरी हो गई। दूसरा शुरू करने से पहले एक बिल्ड रोकें।
pa: ਇੱਕੋ ਵੇਲੇ ਬਿਲਡਾਂ ਦੀ ਸੀਮਾ ਪੂਰੀ ਹੋ ਗਈ। ਦੂਜਾ ਸ਼ੁਰੂ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਇੱਕ ਬਿਲਡ ਰੋਕੋ।

source: Maximum log file size
hi: अधिकतम लॉग फ़ाइल आकार
pa: ਵੱਧ ਤੋਂ ਵੱਧ ਲੌਗ ਫ਼ਾਈਲ ਆਕਾਰ

source: Maximum number of builds that can run at the same time.
hi: एक साथ चल सकने वाले बिल्ड की अधिकतम संख्या।
pa: ਇੱਕੋ ਵੇਲੇ ਚੱਲ ਸਕਣ ਵਾਲੀਆਂ ਬਿਲਡਾਂ ਦੀ ਵੱਧ ਤੋਂ ਵੱਧ ਗਿਣਤੀ।

source: Maximum number of Recent Repositories
hi: हाल की रिपॉज़िटरी की अधिकतम संख्या
pa: ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਦੀ ਵੱਧ ਤੋਂ ਵੱਧ ਗਿਣਤੀ

source: Maximum number of stored logs
hi: संग्रहित लॉग की अधिकतम संख्या
pa: ਸੰਭਾਲੇ ਲੌਗਾਂ ਦੀ ਵੱਧ ਤੋਂ ਵੱਧ ਗਿਣਤੀ

source: Maximum recent repositories
hi: अधिकतम हाल की रिपॉज़िटरी
pa: ਵੱਧ ਤੋਂ ਵੱਧ ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀਆਂ

source: Maximum time allowed for a single build to run.
hi: एक बिल्ड को चलने के लिए अनुमत अधिकतम समय।
pa: ਇੱਕ ਬਿਲਡ ਚੱਲਣ ਲਈ ਮਨਜ਼ੂਰ ਵੱਧ ਤੋਂ ਵੱਧ ਸਮਾਂ।

source: Medium (280px)
hi: मध्यम (280px)
pa: ਦਰਮਿਆਨਾ (280px)

source: Menus and system text change the next time the app is opened. Everything else keeps working in the meantime.
hi: मेन्यू और सिस्टम टेक्स्ट अगली बार ऐप खुलने पर बदलेंगे। तब तक बाकी सब काम करता रहेगा।
pa: ਮੀਨੂ ਅਤੇ ਸਿਸਟਮ ਲਿਖਾਈ ਅਗਲੀ ਵਾਰ ਐਪ ਖੁੱਲ੍ਹਣ ਤੇ ਬਦਲਣਗੇ। ਉਦੋਂ ਤੱਕ ਬਾਕੀ ਸਭ ਕੁਝ ਕੰਮ ਕਰਦਾ ਰਹੇਗਾ।

source: Minimize transparency effects for better readability.
hi: बेहतर पठनीयता के लिए पारदर्शिता कम करें।
pa: ਬਿਹਤਰ ਪੜ੍ਹਨਯੋਗਤਾ ਲਈ ਪਾਰਦਰਸ਼ਿਤਾ ਘਟਾਓ।

source: Missing
hi: अनुपस्थित
pa: ਗੁੰਮ

source: More actions for %@
hi: %@ के लिए और क्रियाएँ
pa: %@ ਲਈ ਹੋਰ ਕਾਰਵਾਈਆਂ

# Most recently run: %@ — %@
source: Most recently run: %1$@ — %2$@
hi: सबसे हाल में चला: %@ — %@
pa: ਸਭ ਤੋਂ ਤਾਜ਼ਾ ਚਲਾਇਆ: %@ — %@

source: Name
hi: नाम
pa: ਨਾਮ

source: Narrow (220px)
hi: संकरा (220px)
pa: ਤੰਗ (220px)

source: Never
hi: कभी नहीं
pa: ਕਦੇ ਨਹੀਂ

source: Never run
hi: कभी नहीं चलाया
pa: ਕਦੇ ਨਹੀਂ ਚਲਾਇਆ

source: Next match
hi: अगला मिलान
pa: ਅਗਲਾ ਮੇਲ

source: No "Don't show again" warning system exists yet — this is a no-op today.
hi: अभी कोई “दोबारा न दिखाएँ” चेतावनी प्रणाली नहीं है — फ़िलहाल इसका कोई असर नहीं।
pa: ਅਜੇ ਕੋਈ "ਦੁਬਾਰਾ ਨਾ ਦਿਖਾਓ" ਚੇਤਾਵਨੀ ਪ੍ਰਣਾਲੀ ਨਹੀਂ ਹੈ — ਅੱਜ ਇਸਦਾ ਕੋਈ ਅਸਰ ਨਹੀਂ।

source: No /build folder
hi: कोई /build फ़ोल्डर नहीं
pa: ਕੋਈ /build ਫ਼ੋਲਡਰ ਨਹੀਂ

source: No /build Folder Found
hi: कोई /build फ़ोल्डर नहीं मिला
pa: ਕੋਈ /build ਫ਼ੋਲਡਰ ਨਹੀਂ ਮਿਲਿਆ

source: No Build Scripts Found
hi: कोई बिल्ड स्क्रिप्ट नहीं मिली
pa: ਕੋਈ ਬਿਲਡ ਸਕ੍ਰਿਪਟ ਨਹੀਂ ਮਿਲੀ

source: No builds run yet for this repository.
hi: इस रिपॉज़िटरी के लिए अभी तक कोई बिल्ड नहीं चला।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਲਈ ਅਜੇ ਕੋਈ ਬਿਲਡ ਨਹੀਂ ਚੱਲੀ।

source: No builds run yet.
hi: अभी तक कोई बिल्ड नहीं चला।
pa: ਅਜੇ ਕੋਈ ਬਿਲਡ ਨਹੀਂ ਚੱਲੀ।

source: No builds yet.
hi: अभी तक कोई बिल्ड नहीं।
pa: ਅਜੇ ਕੋਈ ਬਿਲਡ ਨਹੀਂ।

source: No log lines match the current filter.
hi: मौजूदा फ़िल्टर से कोई लॉग पंक्ति मेल नहीं खाती।
pa: ਮੌਜੂਦਾ ਫ਼ਿਲਟਰ ਨਾਲ ਕੋਈ ਲੌਗ ਲਾਈਨ ਮੇਲ ਨਹੀਂ ਖਾਂਦੀ।

source: No Logs Yet
hi: अभी कोई लॉग नहीं
pa: ਅਜੇ ਕੋਈ ਲੌਗ ਨਹੀਂ

source: No Markdown Files
hi: कोई Markdown फ़ाइल नहीं
pa: ਕੋਈ Markdown ਫ਼ਾਈਲ ਨਹੀਂ
